base/Catalogs/бит_НастройкиФормВводаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиФормВводаБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыНастроекФормВводаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Comment>Хранит настройки построителя отчета для заполнения форм ввода бюджетов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет_Количество</Name>
					<Comment>Учет по количеству</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет_Сумма</Name>
					<Comment>Учет по сумме</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Бюджет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНаименованияСтатейБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОбщиеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъединятьЯчейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКоэффициентыСтатейБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПланирования</Name>
					<Comment>Начало интервала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПланирования</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДерева</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Ячейка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Аргумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьИнтервала</Name>
					<Comment>Продолжительность интервала планирования (количество периодов планирования)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрНорм</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыПроизвольныхПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищатьФормулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияВыходныхДней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыОтображенияВыходныхДнейФормыВвода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедакцияНастроек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемыБФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКодификатор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
					<Comment>Измерения - измерения бюджетирования</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыЗаполненияИзмеренийВФормахВвода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеИтоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НарастающийИтог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Формулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяЯчейки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Enums/бит_ВидыНастроекФормВводаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыНастроекФормВводаБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Динамическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйМакет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_РежимыОтображенияВыходныхДнейФормыВвода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыОтображенияВыходныхДнейФормыВвода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выделять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтображать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_НастройкиФормВводаБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйпрограммныйИнтерфейс

#Область ОбработчикиОбновленияИБ

Процедура СкорректироватьКлючОбъектаПриОбновлении() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиФормВводаБюджета.Ссылка,
	|	бит_НастройкиФормВводаБюджета.ТекстЗапроса
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК бит_НастройкиФормВводаБюджета
	|ГДЕ
	|	НЕ бит_НастройкиФормВводаБюджета.ЭтоГруппа";
				   
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Найти(Выборка.ТекстЗапроса, "бит_ЦФО") > 0 ИЛИ Найти(Выборка.ТекстЗапроса, "бит_Проекты") > 0 Тогда
			СпрОб = Выборка.Ссылка.ПолучитьОбъект();
			СпрОб.СформироватьТекстЗапроса();
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СпрОб);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьИспользоватьОбщиеИтогиПриОбновлении() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиФормВводаБюджета.Ссылка
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК бит_НастройкиФормВводаБюджета
	|ГДЕ
	|	НЕ бит_НастройкиФормВводаБюджета.ЭтоГруппа
	|	И НЕ бит_НастройкиФормВводаБюджета.ВыводитьОбщиеИтоги";
	
	Результат = Запрос.Выполнить();			   
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СпрОб = Выборка.Ссылка.ПолучитьОбъект();
		СпрОб.ВыводитьОбщиеИтоги = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СпрОб);		
	КонецЦикла; 
	
КонецПроцедуры

Процедура УстановитьВидНастройкиПриОбновлении() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидПустой", Перечисления.бит_ВидыНастроекФормВводаБюджета.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпрТаб.Ссылка
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК СпрТаб
	|ГДЕ
	|	НЕ СпрТаб.ЭтоГруппа
	|	И (СпрТаб.Вид = &ВидПустой
	|			ИЛИ СпрТаб.Цвет_Группа = """")";
				   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.Динамическая;
		ТекущийОбъект.ЦветаПоУмолчанию();
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	КонецЦикла; 
	
КонецПроцедуры

// Процедура заполняет реквизит Цвет_Аргумент в настройках форм ввода бюджета. 
// 
Процедура ЗаполнитьЦветАргументовПриОбновлении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиФормВводаБюджета.Ссылка
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК бит_НастройкиФормВводаБюджета
	|ГДЕ
	|	бит_НастройкиФормВводаБюджета.Цвет_Аргумент = """"";
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.Цвет_Аргумент = "#F1F1F1";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	КонецЦикла;	
	
КонецПроцедуры

// Сжимает данные в технических реквизитах с типом ХранилищеЗначения.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура СжатьХранилищаЗначений(Параметры) Экспорт

	Совместимо = Истина; 
	
КонецПроцедуры

Процедура УстановитьВыводитьКодификаторПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиФормВводаБюджета.Ссылка КАК Ссылка,
	|	бит_НастройкиФормВводаБюджета.ВерсияПодсистемыБФ КАК ВерсияПодсистемыБФ,
	|	бит_НастройкиФормВводаБюджета.ВыводитьКодификатор КАК ВыводитьКодификатор
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК бит_НастройкиФормВводаБюджета
	|ГДЕ
	|	НЕ бит_НастройкиФормВводаБюджета.ЭтоГруппа
	|	И НЕ бит_НастройкиФормВводаБюджета.ВыводитьКодификатор";
				   
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();  
	
	// ++ ЕРП 
	МладшаяВерсияПодсистемыБФ = "3.2.42.1";
	СтаршаяВерсияПодсистемыБФ = "3.2.42.4";
	// -- ЕРП
	
	Пока Выборка.Следующий() Цикл  
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Выборка.ВерсияПодсистемыБФ, МладшаяВерсияПодсистемыБФ) > 0 Тогда
			Продолжить;		
		КонецЕсли;     
		
		ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.ВыводитьКодификатор = Истина; 
		ТекущийОбъект.ВерсияПодсистемыБФ  = СтаршаяВерсияПодсистемыБФ;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

// Функция возвращает цвета формы ввода по-умолчанию.
// 
// Возвращаемое значение:
//  Цвета - Структура.
// 
Функция ЦветаПоУмолчанию() Экспорт

	Цвета = Новый Структура;
	
	Цвета.Вставить("Цвет_Группа","#FFFACD");  // LemonChiffon.
	Цвета.Вставить("Цвет_Ячейка","#90EE90");  // LightGreen.
	Цвета.Вставить("Цвет_Формула","#CCFFCC"); // Добавленный реквизит фон.
	Цвета.Вставить("Цвет_Аргумент","#F1F1F1");

	Возврат Цвета;
	
КонецФункции
   
// Подготавливает настройки измерений формы ввода бюджета 
// по элементу справочника бит_НастройкиФормВводаБюджета.
// 
// Параметры:
//  Настройка - СправочникСсылка.бит_НастройкиФормВводаБюджета.
// 
// Возвращаемое значение:
//  РезСтр - Структура.
// 
Функция ПодготовитьНастройки(Настройка) Экспорт

	СвойстваНастройки = Новый Структура;
	СвойстваНастройки.Вставить("ФиксированныйМакет", 					 Ложь);
	СвойстваНастройки.Вставить("ИмяКласса", 							 "НастройкиИзмеренийФормыВводаБюджета");
	СвойстваНастройки.Вставить("Настройка", 							 Неопределено);
	СвойстваНастройки.Вставить("ИспользоватьНаименованияСтатейБюджета",  Ложь);
	СвойстваНастройки.Вставить("ИспользоватьКоэффициентыСтатейБюджета",  Ложь);
	СвойстваНастройки.Вставить("СпособыЗаполнения", 					 Новый Соответствие);
	СвойстваНастройки.Вставить("Измерения", 							 Новый Структура);
	СвойстваНастройки.Вставить("ДополнительныеИтоги", 					 Новый Массив);
	СвойстваНастройки.Вставить("ВыводитьОбщиеИтоги", 					 Ложь); 
	СвойстваНастройки.Вставить("ВыводитьКодификатор", 					 Ложь); 
	СвойстваНастройки.Вставить("УчетКоличество", 						 Ложь);
	СвойстваНастройки.Вставить("УчетСумма", 							 Ложь);
	СвойстваНастройки.Вставить("Бюджет", 								 Неопределено);
	СвойстваНастройки.Вставить("ОбъединятьЯчейки", 					 	 Ложь);
	СвойстваНастройки.Вставить("КоличествоРазворачивать", 				 0);
	СвойстваНастройки.Вставить("Периодичность", 						 Неопределено);
	СвойстваНастройки.Вставить("ОтображениеВыходных", 					 Ложь);
	СвойстваНастройки.Вставить("Цвета", 								 Неопределено);
	СвойстваНастройки.Вставить("ИмяРазворачивать", 					 	 "СтатьяОборотов");
			
	ДанныеСправочника = ДанныеСправочникаПодготовкиНастройки(Настройка);	
	Реквизиты		  = ДанныеСправочника.Реквизиты;
	ТаблицаИзмерения  = ДанныеСправочника.ТаблицаИзмерения;
	ТаблицаДопИтоги   = ДанныеСправочника.ТаблицаДопИтоги;
	
	ФиксированныйМакет  = (Реквизиты.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет);   
	
	Если ЗначениеЗаполнено(Реквизиты.РежимОтображенияВыходныхДней) Тогда
		ОтображениеВыходных = Реквизиты.РежимОтображенияВыходныхДней; 
	Иначе
		ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Обычный; 
	КонецЕсли;

	ВсеСпособыЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода; 
	
	СпособыЗаполнения = Новый Соответствие;
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.ПоУмолчанию, 			   Новый Массив);
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.ПоУмолчаниюРедактирование, Новый Массив);
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.Разворачивать, 			   Новый Массив);
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.РучнойВвод, 	 		   Новый Массив);
	
	ИзмеренияПроизвольные = бит_Бюджетирование.НастройкиИзмеренийБюджетирования();	
	Измерения 			  = Новый Структура;
	
	КоличествоРазворачивать = 0;
	
	Для каждого СтрокаТаблицы Из ТаблицаИзмерения Цикл
		
		РезультатПоиска = СпособыЗаполнения.Получить(СтрокаТаблицы.СпособЗаполнения);
		Если РезультатПоиска <> Неопределено Тогда
		     РезультатПоиска.Добавить(СтрокаТаблицы.Имя);
		КонецЕсли;
		
		Если СтрокаТаблицы.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать Тогда
			КоличествоРазворачивать = КоличествоРазворачивать + 1;		
		КонецЕсли;                                                
		
		ИзмерениеПроизвольное = ИзмеренияПроизвольные[СтрокаТаблицы.Имя];
		Синоним			   = ?(ИзмерениеПроизвольное = Неопределено, "", ИзмерениеПроизвольное.Синоним);
		
		ОписаниеИзмерения = ОписаниеИзмерения(СтрокаТаблицы.Имя, Синоним, СтрокаТаблицы.СпособЗаполнения,
								СтрокаТаблицы.ЗначениеПоУмолчанию);
		Измерения.Вставить(СтрокаТаблицы.Имя, ОписаниеИзмерения);
	КонецЦикла; 
	
	ДопИтоги = Новый Массив;
	Для каждого СтрокаТаблицы Из ТаблицаДопИтоги Цикл
		СтрОписание = Новый Структура("Периодичность, НарастающийИтог");
		ЗаполнитьЗначенияСвойств(СтрОписание, СтрокаТаблицы);
		ДопИтоги.Добавить(СтрОписание);
	КонецЦикла; 
		
	ЦветаНастройки = ЦветаПоУмолчанию();	
	Для каждого КлючЗначение Из ЦветаНастройки Цикл
		Если ЗначениеЗаполнено(Реквизиты[КлючЗначение.Ключ]) Тогда
			ЦветСтрокой = Реквизиты[КлючЗначение.Ключ];
		Иначе	
			ЦветСтрокой = КлючЗначение.Значение;
		КонецЕсли; 
		ЦветаНастройки[КлючЗначение.Ключ] = Обработки.бит_ПреобразованияЦветов.HexToColor(ЦветСтрокой);
	КонецЦикла;  
	
	РазворачитьПо = "СтатьяОборотов";
	Если КоличествоРазворачивать > 0 Тогда
		РазворачитьПо = СпособыЗаполнения[ВсеСпособыЗаполнения.Разворачивать][0];
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СвойстваНастройки, Реквизиты); 

	СвойстваНастройки.СпособыЗаполнения	   	  = СпособыЗаполнения;
	СвойстваНастройки.Измерения			   	  = Измерения;
	СвойстваНастройки.ДополнительныеИтоги 	  = ДопИтоги;
	СвойстваНастройки.КоличествоРазворачивать = КоличествоРазворачивать;
	СвойстваНастройки.Цвета 				  = ЦветаНастройки;
	СвойстваНастройки.ИмяРазворачивать		  = РазворачитьПо;
    СвойстваНастройки.ФиксированныйМакет 	  = ФиксированныйМакет;
	СвойстваНастройки.УчетКоличество 	  	  = Реквизиты.Учет_Количество;
	СвойстваНастройки.УчетСумма 	  		  = Реквизиты.Учет_Сумма;
    СвойстваНастройки.Периодичность			  = Реквизиты.ПериодичностьПланирования;
	СвойстваНастройки.ОтображениеВыходных	  = ОтображениеВыходных;

	Возврат СвойстваНастройки;
	
КонецФункции

Функция ДанныеСправочникаПодготовкиНастройки(Настройка)	
	
	ДанныеСправочника = Новый Структура; 
	ДанныеСправочника.Вставить("Вид", 									Перечисления.бит_ВидыНастроекФормВводаБюджета.ПустаяСсылка());
	ДанныеСправочника.Вставить("ИспользоватьНаименованияСтатейБюджета", Ложь);
	ДанныеСправочника.Вставить("ИспользоватьКоэффициентыСтатейБюджета", Ложь);
	ДанныеСправочника.Вставить("ВыводитьОбщиеИтоги", 					Ложь);
	ДанныеСправочника.Вставить("Учет_Количество", 						Ложь);
	ДанныеСправочника.Вставить("Учет_Сумма", 							Ложь);
	ДанныеСправочника.Вставить("ОбъединятьЯчейки", 						Ложь);
	ДанныеСправочника.Вставить("ПериодичностьПланирования", 			Перечисления.бит_ПериодичностьПланирования);
	ДанныеСправочника.Вставить("РежимОтображенияВыходныхДней", 			Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Обычный);
	ДанныеСправочника.Вставить("ВыводитьКодификатор", 					Ложь);
	ДанныеСправочника.Вставить("Бюджет", 								Справочники.бит_Бюджеты.ПустаяСсылка());
	ДанныеСправочника.Вставить("Цвет_Группа", 							"");
	ДанныеСправочника.Вставить("Цвет_Ячейка", 							"");
	ДанныеСправочника.Вставить("Цвет_Аргумент", 						"");
	ДанныеСправочника.Вставить("Цвет_Формула", 							"");
	ДанныеСправочника.Вставить("Измерения", 							Новый ТаблицаЗначений);
	ДанныеСправочника.Вставить("ДополнительныеИтоги", 					Новый ТаблицаЗначений);
	
	ЗаполнитьЗначенияСвойств(ДанныеСправочника, ЦветаПоУмолчанию());
	
	Если ТипЗнч(Настройка) = Тип("СправочникСсылка.бит_НастройкиФормВводаБюджета") И ЗначениеЗаполнено(Настройка) Тогда 
		Свойства 		  = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ДанныеСправочника, ",");
		ДанныеСправочника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Настройка, Свойства);  
		ДанныеСправочника.Измерения			  = ДанныеСправочника.Измерения.Выгрузить();
		ДанныеСправочника.ДополнительныеИтоги = ДанныеСправочника.ДополнительныеИтоги.Выгрузить();
	Иначе	
		ЗаполнитьЗначенияСвойств(ДанныеСправочника, Настройка);  
		ДанныеСправочника.Измерения			  = Настройка.Измерения.Выгрузить();
		ДанныеСправочника.ДополнительныеИтоги = Настройка.ДополнительныеИтоги.Выгрузить();
	КонецЕсли;	
	
	ДанныеСправочника.Вставить("Настройка", Настройка);
	
	Результат = Новый Структура; 
	Результат.Вставить("Реквизиты", 	   ДанныеСправочника);
	Результат.Вставить("ТаблицаИзмерения", ДанныеСправочника.Измерения);
	Результат.Вставить("ТаблицаДопИтоги",  ДанныеСправочника.ДополнительныеИтоги);
	
    Возврат  Результат;
	
КонецФункции

// Процедура инициализирует компоновщик, используемый для фильтрации структуры дерева.
// 
Функция ИнициализироватьКомпоновщик(вхТекстЗапроса, Компоновщик, УникальныйИдентификатор, 
			ЗагрузитьНастройкиПоУмолчанию = Истина, Бюджет = Неопределено) Экспорт
	
	АдресКомпоновки = "";
	ТекстЗапроса = бит_МеханизмПолученияДанных.АдаптироватьТекстПостроителяДляКомпоновки(вхТекстЗапроса);
	
	ПредОтбор = Компоновщик.Настройки.Отбор.Элементы;
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		// Создаем СКД по запросу.
		СКД = СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		
		Если Найти(ТекстЗапроса, "&Бюджет") > 0 Тогда
			// Параметр Бюджет не должен быть доступен в настройках СКД.
			ПараметрСКД = СКД.Параметры.Добавить();
			ПараметрСКД.Имя                      = "Бюджет";
			ПараметрСКД.Заголовок                = "Бюджет";
			ПараметрСКД.ТипЗначения              = Новый ОписаниеТипов("СправочникСсылка.бит_Бюджеты");
			ПараметрСКД.ВключатьВДоступныеПоля   = Ложь;
			ПараметрСКД.ОграничениеИспользования = Истина;
			ПараметрСКД.Значение                 = Бюджет;
		КонецЕсли; 
		
		НастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");
		бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийНастройкиФормыВвода(СКД, 
			"НаборДанныхОсновной",НастройкиИзмерений,,Ложь);	
		
		АдресКомпоновки = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
		
		// Инициализируем компоновщик.
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновки);
		Попытка
			Компоновщик.Инициализировать(ИсточникНастроек);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось инициализировать компоновщик для отбора. Попробуйте обновить текст запроса. Описание ошибки: %1.';
								  |en='Failed to initialize builder for selection. Try refreshing the query text. Description of error: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
		Если ЗагрузитьНастройкиПоУмолчанию Тогда
			Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
			Если ПредОтбор.Количество() > 0 Тогда
				Для каждого Эл Из ПредОтбор Цикл
					НовЭл = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип(Эл));
					ЗаполнитьЗначенияСвойств(НовЭл, Эл);
				КонецЦикла; 
				Компоновщик.Восстановить();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат АдресКомпоновки;
	
КонецФункции

// Процедура проверяет множественный разворот по статьям оборотов.
// 
// Параметры:
//  ТабЧастьИзмерения - ТабличнаяЧасть.
//  Отказ - Булево.
// 
Процедура ПроверитьМножественныйРазворотПоСтатьям(ТабЧастьИзмерения, Отказ, ВыводитьСообщения = Истина)  Экспорт
	
	// Проверка на двойной разворот по статьи.
	ИзмеренияБюдж     = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","имя");		
	КолРазворотСтатья = 0;
	Для каждого СтрокаТаблицы Из ТабЧастьИзмерения Цикл
		
		СтрИзмер = ИзмеренияБюдж[СтрокаТаблицы.Имя];
		
		Если СтрИзмер.Имя = "бит_СтатьиОборотов" 
			 И СтрокаТаблицы.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать Тогда
			
			КолРазворотСтатья = КолРазворотСтатья + 1;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если КолРазворотСтатья > 1 Тогда
		
		Если ВыводитьСообщения Тогда
			
			ТекстСообщения = НСтр("ru='Не допускается более одного разворота по Статьям оборотов.';
								  |en='It is not allowed more than one turn of the Articles of revolutions.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли; 
		
		Отказ = Истина;
		
	КонецЕсли; 		
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Функция создает схему компоновки данных по тексту запроса.
// 
// Параметры:
// ТекстЗапроса - Строка
// ИмяНабораДанных - Строка
// 
// Возвращаемое значение:
//  СКД - СхемаКомпоновкиДанных.
// 
Функция СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса)

	СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса, "НаборДанныхОсновной");
	ПолеСсылка = СКД.НаборыДанных["НаборДанныхОсновной"].Поля.Найти("Ссылка");
	Если ПолеСсылка <> Неопределено Тогда
		ПолеСсылка.Заголовок = НСтр("ru = 'Измерение'");
	КонецЕсли;
	
	Возврат СКД
	
КонецФункции

// Функция-конструктор структуры, описывающий измерение в форме ввода.
// 
// Параметры:
// Имя - Строка
// Синоним - Строка
// СпособЗаполнения - ПеречислениеСсылка.бит_СпособыЗаполненияИзмеренийВФормахВвода
// ЗначениеПоУмолчанию - Произвольный.
// 
// Возвращаемое значение:
//  РезСтруктура - Структура.
// 
Функция ОписаниеИзмерения(Имя, Синоним, СпособЗаполнения, ЗначениеПоУмолчанию)

	Результат = Новый Структура; 
	Результат.Вставить("ИмяКласса", 		 "НастройкаИзмеренияФормыВводаБюджета");
	Результат.Вставить("Имя",				 Имя);
	Результат.Вставить("Синоним", 			 Синоним);
	Результат.Вставить("СпособЗаполнения",	 СпособЗаполнения);
	Результат.Вставить("ЗначениеПоУмолчанию",ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
